timetracker/Documents/РегистрацияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РегистрацияВремени</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИспользованоВремени</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотраченоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

timetracker/AccumulationRegisters/ИспользованоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИспользованоВремени</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПотраченоМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

timetracker/Documents/РегистрацияВремени/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Задачи.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.РегистрацияВремени КАК РегистрацияВремени
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Задачи КАК Задачи
	//	|		ПО РегистрацияВремени.Задача = Задачи.Ссылка
	//	|ГДЕ
	//	|	РегистрацияВремени.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//Ссылка = Выборка.Ссылка;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
					|	Задачи.Проект КАК Проект,
					|	РегистрацияВремени.ВремяНачала КАК ВремяНачала,
					|	РегистрацияВремени.ВремяОкончания КАК ВремяОкончания
					|ИЗ
					|	Документ.РегистрацияВремени КАК РегистрацияВремени
					|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Задачи КАК Задачи
					|	ПО (РегистрацияВремени.Задача = Задачи.Ссылка)
					|ГДЕ
					|	РегистрацияВремени.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	Проект = Выборка.Проект;
	ВремяНачала = Выборка.ВремяНачала;
	ВремяОкончания = Выборка.ВремяОкончания;
	
	//потррачено = оконч - начала
	ВНЧисло = Час(ВремяНачала)*60 + Минута(ВремяНачала) + Секунда(ВремяНачала)/60;
	ВОЧисло = Час(ВремяОкончания)*60 + Минута(ВремяОкончания) + Секунда(ВремяОкончания)/60; 
	ПотраченоМинут = ВОЧисло - ВНЧисло;
	
	
	// регистр ИспользованоВремени Приход
	Движения.ИспользованоВремени.Записывать = Истина;
	Движение = Движения.ИспользованоВремени.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Задача = Задача;
	Движение.Проект = Проект;
	Движение.ПотраченоМинут = ПотраченоМинут;

	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(ВремяНачала) И НЕ ЗначениеЗаполнено(ВремяОкончания) Тогда
		ВызватьИсключение "Заполните время началы и окончания!";
		//Отказ = истина;
	КонецЕсли; 
	
	ПотраченоВремени = ВремяОкончания - ВремяНачала;
	
	Если ПотраченоВремени <=0 Тогда
	     ВызватьИсключение "Время окончания не может быть раньше или равно времени начала!";
		 //Отказ = истина;
	КонецЕсли;
	
	Если ПотраченоВремени <= 60 Тогда
		ВызватьИсключение "Длительность меньше минуты.";
		//Отказ = истина;
	Иначе
		ПотраченоВремени = ПотраченоВремени / 60; 
		
	КонецЕсли;    
	
КонецПроцедуры
